Table of Contents
 Class IdeaUserEventImplementation
Namespace
IdeaStatiCa.BimApiLink.Plugin
Assembly
IdeaStatiCa.BimApiLink.dll
Implementation class. Don't use directly, but call from the derived classes
public abstract class IdeaUserEventImplementation : IIdeaUserEvent
Inheritance
object
IdeaUserEventImplementation
Implements
IIdeaUserEvent
Derived
BimConnectionsImportEvent
BimConnectionsSynchronizeEvent
BimPluginCommandEvent
Inherited Members
 object.ToString()
 object.Equals(object)
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
Properties
 EventAction
Event action for the 'ea' Google Analytics parameter. Use the verb form, for example "Started application", "application started", "clicked ribbon tab Design", "clicked ribbon command Calculate", "opened connection project", etc.
public string EventAction { get; }
Property Value
string
 EventCategory
Event category for the 'ec' Google Analytics parameter. Use one of the predefined categories. Must not be null.
public string EventCategory { get; }
Property Value
string
 EventLabel
Event label for the 'el' Google Analytics parameter that specifies the additional event dimension. Can contain name of button, type of project, etc. Can be null.
public string EventLabel { get; }
Property Value
string
 EventName
Unique event type identifier, lower case, underscore-seprated string. For example "navigation_click", "cb_publish", etc.
public string EventName { get; }
Property Value
string
Remarks
Used for cross platform correlation of the event data in the Google Analuytics 4
 EventValue
Event value for the 'ev' Google Analytics parameter that specifies the numeric value of the event. Can contain the projects or connections count or anything else that might be interesting to aggregate in the reports. Can be 0, means no value.
public int EventValue { get; }
Property Value
int
 Edit this page